// Напишіть код, який запитує логін за допомогою prompt.
//
//     Якщо відвідувач вводить "Admin", тоді запропонуйте за допомогою prompt ввести пароль. Якщо введено порожній рядок або натиснуто Esc – показати “Скасовано”. Якщо введено інший рядок – тоді покажіть “Я вас не знаю”.
//
// Пароль перевіряється наступним чином:
//
//     Якщо він дорівнює “Господар”, тоді покажіть “Ласкаво просимо!”,
// Інший рядок – покажіть “Неправильний пароль”,
// Для порожнього рядка, або якщо введення було скасовано, покажіть “Скасовано”.
// Схема:
//
//
//     Будь ласка, використовуйте вкладені if блоки. Потурбуйтесь про загальну читабельність коду.
//
//     Підказка: передача порожнього вводу до запиту повертає порожній рядок ''. Натискання ESC протягом запиту повертає null.
//
//     Запустити демонстрацію
