// Напишіть код, який запитує логін за допомогою prompt.
//
//     Якщо відвідувач вводить "Admin", тоді запропонуйте за допомогою prompt ввести пароль. Якщо введено порожній рядок або натиснуто Esc – показати “Скасовано”. Якщо введено інший рядок – тоді покажіть “Я вас не знаю”.
//
// Пароль перевіряється наступним чином:
//
//     Якщо він дорівнює “Господар”, тоді покажіть “Ласкаво просимо!”,
// Інший рядок – покажіть “Неправильний пароль”,
// Для порожнього рядка, або якщо введення було скасовано, покажіть “Скасовано”.
// Схема:
//
//
//     Будь ласка, використовуйте вкладені if блоки. Потурбуйтесь про загальну читабельність коду.
//
//     Підказка: передача порожнього вводу до запиту повертає порожній рядок ''. Натискання ESC протягом запиту повертає null.
//
//     Запустити демонстрацію



// Створіть функцію multiplyNumeric(obj), яка примножує всі числові властивості об’єкта obj на 2.

// Наприклад:

// // до виклику функції
// let menu = {
//   width: 200,
//   height: 300,
//   title: "Моє меню"
// };

// multiplyNumeric(menu);

// // після виклику функції
// menu = {
//   width: 400,
//   height: 600,
//   title: "Моє меню"
// };
// Зверніть увагу, що multiplyNumeric не потрібно нічого повертати. Слід безпосередньо змінювати об’єкт.

// P.S. Використовуйте typeof для перевірки, що значення властивості числове.



  
